app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    #idでTasksテーブルを取得
  @task = Task.find(params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    #idでタスクテーブルを取得
  @task = Task.find(params[:id])

INSERT INTO "tasks" ("name", "shosai", "kigen", "kanryo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    #POSTされた値を元にTasksテーブル登録用レコードを作成
  @task = Task.new(task_params)

  #エラーチェック
  if @task.valid?
    #--------------
    #エラーがない場合
    #--------------
    if @task.kigen_str.present?
      @task.kigen = Date.new(
        @task.kigen_str[0..3].to_i,
        @task.kigen_str[4..5].to_i,
        @task.kigen_str[6..7].to_i)
    end
    @task.kanryo = false

    #更新（エラーチェックを行わない）
    @task.save(validate:false)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def update
    #POSTされた値(id)からレコードを取得
  @task = Task.find(params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "kanryo" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["kanryo", true], ["updated_at", 2018-05-13 07:51:02 UTC], ["id", 1]]
---
  def kanryo
    #idでTasksテーブルを取得
    @task = Task.find(params[:id])

    #kanryoにtrueをセット
    @task.kanryo = true

    #更新処理（update文発行）
    @task.save